Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025daa288.h
#define _CNENF_CNIEF4_POSITION                   0x00000004
#define _CNENF_CNIEF4_MASK                       0x00000010
#define _CNENF_CNIEF4_LENGTH                     0x00000001

#define _CNENF_CNIEF5_POSITION                   0x00000005
#define _CNENF_CNIEF5_MASK                       0x00000020
#define _CNENF_CNIEF5_LENGTH                     0x00000001

#define _CNENF_CNIEF8_POSITION                   0x00000008
#define _CNENF_CNIEF8_MASK                       0x00000100
#define _CNENF_CNIEF8_LENGTH                     0x00000001

#define _CNENF_CNIEF12_POSITION                  0x0000000C
#define _CNENF_CNIEF12_MASK                      0x00001000
#define _CNENF_CNIEF12_LENGTH                    0x00000001

#define _CNENF_CNIEF13_POSITION                  0x0000000D
#define _CNENF_CNIEF13_MASK                      0x00002000
#define _CNENF_CNIEF13_LENGTH                    0x00000001

#define _CNENF_w_POSITION                        0x00000000
#define _CNENF_w_MASK                            0xFFFFFFFF
#define _CNENF_w_LENGTH                          0x00000020

#define _CNSTATF_CNSTATF0_POSITION               0x00000000
#define _CNSTATF_CNSTATF0_MASK                   0x00000001
#define _CNSTATF_CNSTATF0_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF1_POSITION               0x00000001
#define _CNSTATF_CNSTATF1_MASK                   0x00000002
#define _CNSTATF_CNSTATF1_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF2_POSITION               0x00000002
#define _CNSTATF_CNSTATF2_MASK                   0x00000004
#define _CNSTATF_CNSTATF2_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF3_POSITION               0x00000003
#define _CNSTATF_CNSTATF3_MASK                   0x00000008
#define _CNSTATF_CNSTATF3_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF4_POSITION               0x00000004
#define _CNSTATF_CNSTATF4_MASK                   0x00000010
#define _CNSTATF_CNSTATF4_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF5_POSITION               0x00000005
#define _CNSTATF_CNSTATF5_MASK                   0x00000020
#define _CNSTATF_CNSTATF5_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF8_POSITION               0x00000008
#define _CNSTATF_CNSTATF8_MASK                   0x00000100
#define _CNSTATF_CNSTATF8_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF12_POSITION              0x0000000C
#define _CNSTATF_CNSTATF12_MASK                  0x00001000
#define _CNSTATF_CNSTATF12_LENGTH                0x00000001

#define _CNSTATF_CNSTATF13_POSITION              0x0000000D
#define _CNSTATF_CNSTATF13_MASK                  0x00002000
#define _CNSTATF_CNSTATF13_LENGTH                0x00000001

#define _CNSTATF_w_POSITION                      0x00000000
#define _CNSTATF_w_MASK                          0xFFFFFFFF
#define _CNSTATF_w_LENGTH                        0x00000020

#define _CNNEF_CNNEF0_POSITION                   0x00000000
#define _CNNEF_CNNEF0_MASK                       0x00000001
#define _CNNEF_CNNEF0_LENGTH                     0x00000001

#define _CNNEF_CNNEF1_POSITION                   0x00000001
#define _CNNEF_CNNEF1_MASK                       0x00000002
#define _CNNEF_CNNEF1_LENGTH                     0x00000001

#define _CNNEF_CNNEF2_POSITION                   0x00000002
#define _CNNEF_CNNEF2_MASK                       0x00000004
#define _CNNEF_CNNEF2_LENGTH                     0x00000001

#define _CNNEF_CNNEF3_POSITION                   0x00000003
#define _CNNEF_CNNEF3_MASK                       0x00000008
#define _CNNEF_CNNEF3_LENGTH                     0x00000001

#define _CNNEF_CNNEF4_POSITION                   0x00000004
#define _CNNEF_CNNEF4_MASK                       0x00000010
#define _CNNEF_CNNEF4_LENGTH                     0x00000001

#define _CNNEF_CNNEF5_POSITION                   0x00000005
#define _CNNEF_CNNEF5_MASK                       0x00000020
#define _CNNEF_CNNEF5_LENGTH                     0x00000001

#define _CNNEF_CNNEF8_POSITION                   0x00000008
#define _CNNEF_CNNEF8_MASK                       0x00000100
#define _CNNEF_CNNEF8_LENGTH                     0x00000001

#define _CNNEF_CNNEF12_POSITION                  0x0000000C
#define _CNNEF_CNNEF12_MASK                      0x00001000
#define _CNNEF_CNNEF12_LENGTH                    0x00000001

#define _CNNEF_CNNEF13_POSITION                  0x0000000D
#define _CNNEF_CNNEF13_MASK                      0x00002000
#define _CNNEF_CNNEF13_LENGTH                    0x00000001

#define _CNFF_CNFF0_POSITION                     0x00000000
#define _CNFF_CNFF0_MASK                         0x00000001
#define _CNFF_CNFF0_LENGTH                       0x00000001

#define _CNFF_CNFF1_POSITION                     0x00000001
#define _CNFF_CNFF1_MASK                         0x00000002
#define _CNFF_CNFF1_LENGTH                       0x00000001

#define _CNFF_CNFF2_POSITION                     0x00000002
#define _CNFF_CNFF2_MASK                         0x00000004
#define _CNFF_CNFF2_LENGTH                       0x00000001

#define _CNFF_CNFF3_POSITION                     0x00000003
#define _CNFF_CNFF3_MASK                         0x00000008
#define _CNFF_CNFF3_LENGTH                       0x00000001

#define _CNFF_CNFF4_POSITION                     0x00000004
#define _CNFF_CNFF4_MASK                         0x00000010
#define _CNFF_CNFF4_LENGTH                       0x00000001

#define _CNFF_CNFF5_POSITION                     0x00000005
#define _CNFF_CNFF5_MASK                         0x00000020
#define _CNFF_CNFF5_LENGTH                       0x00000001

#define _CNFF_CNFF8_POSITION                     0x00000008
#define _CNFF_CNFF8_MASK                         0x00000100
#define _CNFF_CNFF8_LENGTH                       0x00000001

#define _CNFF_CNFF12_POSITION                    0x0000000C
#define _CNFF_CNFF12_MASK                        0x00001000
#define _CNFF_CNFF12_LENGTH                      0x00000001

#define _CNFF_CNFF13_POSITION                    0x0000000D
#define _CNFF_CNFF13_MASK                        0x00002000
#define _CNFF_CNFF13_LENGTH                      0x00000001

#define _SRCON0F_SR0F0_POSITION                  0x00000000
#define _SRCON0F_SR0F0_MASK                      0x00000001
#define _SRCON0F_SR0F0_LENGTH                    0x00000001

#define _SRCON0F_SR0F1_POSITION                  0x00000001
#define _SRCON0F_SR0F1_MASK                      0x00000002
#define _SRCON0F_SR0F1_LENGTH                    0x00000001

#define _SRCON0F_SR0F2_POSITION                  0x00000002
#define _SRCON0F_SR0F2_MASK                      0x00000004
#define _SRCON0F_SR0F2_LENGTH                    0x00000001

#define _SRCON0F_SR0F3_POSITION                  0x00000003
#define _SRCON0F_SR0F3_MASK                      0x00000008
#define _SRCON0F_SR0F3_LENGTH                    0x00000001

